robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_can-with-isr.c
/*
 * Copyright (C) 2011 Department of Robotics Brain and Cognitive Sciences - Istituto Italiano di Tecnologia
 * Author:  Valentina Gaggero, Marco Accame
 * email:   valentina.gaggero@iit.it, marco.accame@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/

/* @file       hal_stm32_can.c
	@brief      This file implements internal implementation of the hal can module.
	@author     marco.accame@iit.it
    @date       05/27/2010
**/

#ifdef HAL_USE_CAN

// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stdlib.h"

#include "stm32f1.h"

#include "string.h"

#include "hal_board_config.h"
#include "hal_stm32_base_hid.h" 
#include "hal_stm32_sys_hid.h"

 
// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "hal_can.h"


// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern hidden interface 
// --------------------------------------------------------------------------------------------------------------------

#include "hal_stm32_can_hid.h" 


// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------

#define HAL_can_port2index(p)           ((uint8_t)((p)))

#define HAL_can_stm32_framedata         CAN_RTR_DATA        //0x00
#define HAL_can_stm32_frameremote       CAN_RTR_REMOTE      //0x02


#define CAN_CLK	  			36000000

//CAN 1 pins
#define RCC_APB2Periph_GPIO_CAN1    RCC_APB2Periph_GPIOD
#define GPIO_REMAP_CAN1             GPIO_Remap2_CAN1
#define GPIO_CAN1                   GPIOD  
#define GPIO_Pin_CAN1_RX            GPIO_Pin_0
#define GPIO_Pin_CAN1_TX            GPIO_Pin_1

//CAN 2 pins
#define RCC_APB2Periph_GPIO_CAN2    RCC_APB2Periph_GPIOB
#define GPIO_REMAP_CAN2             GPIO_Remap_CAN2
#define GPIO_CAN2                   GPIOB  
#define GPIO_Pin_CAN2_RX            GPIO_Pin_5
#define GPIO_Pin_CAN2_TX            GPIO_Pin_6


///enable and disable interupt on receive
#define CAN_IT_RX_ENA(p) 	CAN_ITConfig( ( ( hal_can_port1 == (p) ) ? (CAN1) : (CAN2) ), CAN_IT_FMP0, ENABLE);
#define CAN_IT_RX_DISA(p)	CAN_ITConfig( ( ( hal_can_port1 == (p) ) ? (CAN1) : (CAN2) ), CAN_IT_FMP0, DISABLE);

///enable and disable interupt on trasmission
#define CAN_IT_TX_ENA(p)	CAN_ITConfig( ( ( hal_can_port1 == (p) ) ? (CAN1) : (CAN2) ), CAN_IT_TME, ENABLE);
#define CAN_IT_TX_DISA(p)	CAN_ITConfig( ( ( hal_can_port1 == (p) ) ? (CAN1) : (CAN2) ), CAN_IT_TME, DISABLE);






// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------

const hal_can_cfg_t hal_can_cfg_default =
{
    .runmode            = hal_can_runmode_isr_1txq1rxq,
    .baudrate           = hal_can_baudrate_1mbps, 
    .priorx             = hal_int_priority06,
    .priotx             = hal_int_priority06,
    .callback_on_rx     = NULL,
    .arg                = NULL
};


// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------

typedef struct
{
    hal_can_cfg_t               cfg;
    hal_genericfifo_t           canframes_rx_norm;
    hal_genericfifo_t           canframes_tx_norm;
    hal_genericfifo_t           canframes_tx_high;
    uint8_t                     enabled;
} hal_can_portdatastructure_t;


// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_can_supported_is(hal_can_port_t port);
static void s_hal_can_initted_set(hal_can_port_t port);
static hal_boolval_t s_hal_can_initted_is(hal_can_port_t port);

// init and start CAN
static void s_hal_can_RCC_conf(hal_can_port_t port);
static void s_hal_can_GPIO_conf(hal_can_port_t port);
static void s_hal_can_NVIC_conf(hal_can_port_t port);
static hal_result_t s_hal_can_register_conf(hal_can_port_t port);

// trasmission
static void s_hal_can_sendframes_canx(hal_can_port_t port);
static void s_hal_can_isr_sendframes_canx(hal_can_port_t port);
static hal_result_t s_hal_frame_convert_2_txstm32format( hal_can_frame_t *frame, CanTxMsg *stm32txcanframe );

// reception
static void s_hal_can_isr_recvframe_canx(hal_can_port_t port);
static hal_result_t s_hal_frame_convert_from_rxstm32format( hal_can_frame_t *frame, CanRxMsg *stm32rxcanframe );


static hal_result_t s_hal_can_tx_withoutisr(hal_can_port_t port, hal_can_frame_t *frame);
static hal_result_t s_hal_can_tx_normprio(hal_can_port_t port, hal_can_frame_t *frame, hal_can_send_mode_t sm);
static hal_result_t s_hal_can_tx_highprio(hal_can_port_t port, hal_can_frame_t *frame);


static void s_hal_can_isr_tx_enable(hal_can_port_t port);
static void s_hal_can_isr_tx_disable(hal_can_port_t port);
static void s_hal_can_isr_rx_enable(hal_can_port_t port);
static void s_hal_can_isr_rx_disable(hal_can_port_t port);


