robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_can-with-isr.c
// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------

static hal_can_portdatastructure_t *s_hal_can_portdatastruct_ptr[hal_can_ports_num] = {NULL, NULL};

static hal_boolval_t s_hal_can_initted[hal_can_ports_num] = { hal_false };


// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------

extern hal_result_t hal_can_init(hal_can_port_t port, const hal_can_cfg_t *cfg)
{
	hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    if(hal_false == s_hal_can_supported_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == cport)
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == cfg)
    {
        cfg  = &hal_can_cfg_default;
    }

    if(hal_can_runmode_isr_1txq1rxq != cfg->runmode)
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_unsupportedbehaviour, "hal_can_init():wrong runmode");
        return(hal_res_NOK_unsupported);  
    }

    
    // set runmode
    memcpy(&cport->cfg, cfg, sizeof(hal_can_cfg_t));


    //  reset fifos
    hal_base_hid_genericfifo_reset(&cport->canframes_rx_norm);
    hal_base_hid_genericfifo_reset(&cport->canframes_tx_norm);
    hal_base_hid_genericfifo_reset(&cport->canframes_tx_high);
    
    // init low level
    hal_brdcfg_can__phydevices_enable(port); /* Enable physical can device */

    s_hal_can_RCC_conf(port); /* System clocks configuration */

    s_hal_can_GPIO_conf(port); /* GPIO configuration */

    s_hal_can_NVIC_conf(port); /* NVIC configuration */

    cport->enabled = 0;

    s_hal_can_initted_set(port);

    return(hal_res_OK);
}


extern hal_result_t hal_can_enable(hal_can_port_t port)
{
	hal_result_t res;
	hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == cport)
    {
        return(hal_res_NOK_generic);
    }

    res = s_hal_can_register_conf(port); /* hardware setup */

    if(res != hal_res_OK)
    {
    	return (hal_res_NOK_generic);
    }


    // disable scheduling
    hal_base_hid_osal_scheduling_suspend();

    cport->enabled = 1;

    // registers
    CAN_IT_RX_ENA(port);
    CAN_IT_TX_ENA(port);

    // nvic 
    s_hal_can_isr_rx_enable(port);
    // enable the nvic for the tx
    s_hal_can_isr_tx_enable(port);
    //s_hal_can_isr_tx_disable(port);

    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();

	return(hal_res_OK);
}


extern hal_result_t hal_can_disable(hal_can_port_t port) 
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == cport)
    {
        return(hal_res_NOK_generic);
    }

    // disable scheduling
    hal_base_hid_osal_scheduling_suspend();

    cport->enabled = 0;

    // registers
    CAN_IT_RX_DISA(port);
    CAN_IT_TX_DISA(port);

    // nvic 
    s_hal_can_isr_rx_disable(port);
    //  disable the nvic for the tx. 
    s_hal_can_isr_tx_disable(port);
    
    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();

    return(hal_res_OK);
}


extern hal_result_t hal_can_put(hal_can_port_t port, hal_can_frame_t *frame, hal_can_send_mode_t sm) 
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    
    hal_result_t res = hal_res_NOK_generic;

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == cport)
    {
        return(hal_res_NOK_generic);
    }

    if(NULL == frame)
    {
        return(hal_res_NOK_nullpointer);
    }

    if(hal_can_send_highprio_now == sm)
    {
        return(hal_res_NOK_generic);
    }


    // so far, the only supported runmode is hal_can_runmode_isr_1txq1rxq
    // thus only sendmode hal_can_send_normprio_now and hal_can_send_normprio_later are supported

    switch(cport->cfg.runmode)
    {
        case hal_can_runmode_noisr_0q:
        {   // used in bootloader for instance
        
            if(hal_can_send_normprio_now == sm)
            {
                res = s_hal_can_tx_withoutisr(port, frame); // not yet supported in arm-hal
            }
            else
            {
                res = hal_res_NOK_unsupported;
            }
        
        } break;
        
        case hal_can_runmode_isr_1txq1rxq:
        case hal_can_runmode_isr_2txq1rxq:
        {
            if((hal_can_send_highprio_now == sm) && (hal_can_runmode_isr_1txq1rxq == cport->cfg.runmode))
            {   // cannot put inside a highprio queue if we only have the normprio queue
                res = hal_res_NOK_generic;
            }
            else if(hal_can_send_highprio_now == sm)
            {   // i am in highprio with the highprio queue (the second one) available
                res =  s_hal_can_tx_highprio(port, frame); // not yet supported in arm-hal
            }
            else
            {   // can be hal_can_send_normprio_now or hal_can_send_normprio_later
                // in either 2q or 1q mode. but in any case i use the normal queue
                res = s_hal_can_tx_normprio(port, frame, sm);
            }
        
        } break;
   
        default:
        {
            res = hal_res_NOK_unsupported;
        } break;        
    
    }

    return(res);
}



extern hal_result_t hal_can_transmit(hal_can_port_t port)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }
    
    if(NULL == cport)
    {
        return(hal_res_NOK_generic);
    }
    
    // disable scheduling
    hal_base_hid_osal_scheduling_suspend();

    s_hal_can_isr_tx_disable(port); // never enabled
    
    // trigger the tx. the trigger will completely empty the canframes_tx_norm.
    //s_hal_can_isr_sendframes_canx(port);
    s_hal_can_sendframes_canx(port);
    
