robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_can-with-isr.c
    s_hal_can_isr_tx_enable(port); // never enabled

   
    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();
    
    return(hal_res_OK);
}



extern hal_result_t hal_can_get(hal_can_port_t port, hal_can_frame_t *frame, uint8_t *remaining) 
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    hal_result_t res = hal_res_NOK_generic;
    uint8_t remain_msg = 0;

    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    if( (NULL == cport) || (NULL == frame) )
    {
        return(hal_res_NOK_generic);
    }
    
    // disable scheduling 
    hal_base_hid_osal_scheduling_suspend();
    
    // disable interrupt rx
    s_hal_can_isr_rx_disable(port);
    
    res = hal_base_hid_genericfifo_get(&cport->canframes_rx_norm, (uint8_t*)frame, &remain_msg);
    
    // enable interrupt rx
    s_hal_can_isr_rx_enable(port);
    
    // enable scheduling 
    hal_base_hid_osal_scheduling_restart();

    if(NULL != remaining)
    {
         *remaining = remain_msg;
    }

    return(res);
}


extern hal_result_t hal_can_receptionfilter_set(hal_can_port_t port, uint8_t mask_num, uint32_t mask_val, uint8_t identifier_num,
                                                uint32_t identifier_val, hal_can_frameID_format_t idformat)
{
    if(hal_false == s_hal_can_initted_is(port))
    {
        return(hal_res_NOK_generic);
    }

    //hal_base_hid_on_fatalerror(hal_fatalerror_unsupportedbehaviour, "hal_can_receptionfilter_set(): not supported");
    return(hal_res_NOK_unsupported);
}




// --------------------------------------------------------------------------------------------------------------------
// - definition of extern hidden functions 
// --------------------------------------------------------------------------------------------------------------------


// ---- isr of the module: begin ----

void CAN1_TX_IRQHandler	(void)
{
  if (CAN1->TSR & (1 << 0)) {                     /* request completed mbx 0 */
    CAN1->TSR |= (1 << 0);                   /* reset request complete mbx 0 */

	s_hal_can_isr_sendframes_canx(hal_can_port1);

    }
}


void CAN2_TX_IRQHandler	(void)
{
  if (CAN2->TSR & (1 << 0)) {                     /* request completed mbx 0 */
    CAN2->TSR |= (1 << 0);                   /* reset request complete mbx 0 */

	s_hal_can_isr_sendframes_canx(hal_can_port2);

    }
}


void CAN1_RX0_IRQHandler(void)
{
	s_hal_can_isr_recvframe_canx(hal_can_port1);
}


void CAN2_RX0_IRQHandler(void)
{
	s_hal_can_isr_recvframe_canx(hal_can_port2);
}

// ---- isr of the module: end ------

 
extern uint32_t hal_can_hid_getsize(const hal_cfg_t *cfg)
{
    uint32_t size = 0;
    
    if(0 != cfg->can1_enable)
    {
        size += sizeof(hal_can_portdatastructure_t);
        size += (cfg->can1_rxqnorm_num * sizeof(hal_can_frame_t));
        size += (cfg->can1_txqnorm_num * sizeof(hal_can_frame_t));        
        size += (cfg->can1_txqhigh_num * sizeof(hal_can_frame_t)); 
    }
    
    if(0 != cfg->can2_enable)
    {
        size += sizeof(hal_can_portdatastructure_t);
        size += (cfg->can2_rxqnorm_num * sizeof(hal_can_frame_t));
        size += (cfg->can2_txqnorm_num * sizeof(hal_can_frame_t));        
        size += (cfg->can2_txqhigh_num * sizeof(hal_can_frame_t)); 
    }

    return(size);
}


extern hal_result_t hal_can_hid_setmem(const hal_cfg_t *cfg, uint32_t *memory)
{
    uint8_t *ram08 = (uint8_t*)memory;
    uint8_t i=0;

    // removed dependancy from NZI ram
    for(i=0; i<hal_can_ports_num; i++)
    {
        s_hal_can_portdatastruct_ptr[i] = NULL;
    }
    memset(s_hal_can_initted, hal_false, hal_can_ports_num);


    if((0 != cfg->can1_enable) || (0 != cfg->can2_enable))
    {
        if(NULL == memory)
        {
            hal_base_hid_on_fatalerror(hal_fatalerror_missingmemory, "hal_can_hid_setmem(): memory missing");
            return(hal_res_NOK_generic);
        }
    }


    if(0 != cfg->can1_enable)
    {
        s_hal_can_portdatastruct_ptr[0] = (hal_can_portdatastructure_t*)ram08;
        ram08 += sizeof(hal_can_portdatastructure_t);
        
        hal_base_hid_genericfifo_init(&s_hal_can_portdatastruct_ptr[0]->canframes_rx_norm, cfg->can1_rxqnorm_num, sizeof(hal_can_frame_t), ram08);
        ram08 += (cfg->can1_rxqnorm_num * sizeof(hal_can_frame_t));
        
        hal_base_hid_genericfifo_init(&s_hal_can_portdatastruct_ptr[0]->canframes_tx_norm, cfg->can1_txqnorm_num, sizeof(hal_can_frame_t), ram08);
        ram08 += (cfg->can1_txqnorm_num * sizeof(hal_can_frame_t));

        hal_base_hid_genericfifo_init(&s_hal_can_portdatastruct_ptr[0]->canframes_tx_high, cfg->can1_txqhigh_num, sizeof(hal_can_frame_t), ram08);
        ram08 += (cfg->can1_txqhigh_num * sizeof(hal_can_frame_t));
    }
    
    if(0 != cfg->can2_enable)
    {
        s_hal_can_portdatastruct_ptr[1] = (hal_can_portdatastructure_t*)ram08;
        ram08 += sizeof(hal_can_portdatastructure_t);
 
        hal_base_hid_genericfifo_init(&s_hal_can_portdatastruct_ptr[1]->canframes_rx_norm, cfg->can2_rxqnorm_num, sizeof(hal_can_frame_t), ram08);
        ram08 += (cfg->can2_rxqnorm_num * sizeof(hal_can_frame_t));
        
        hal_base_hid_genericfifo_init(&s_hal_can_portdatastruct_ptr[1]->canframes_tx_norm, cfg->can2_txqnorm_num, sizeof(hal_can_frame_t), ram08);
        ram08 += (cfg->can2_txqnorm_num * sizeof(hal_can_frame_t));

        hal_base_hid_genericfifo_init(&s_hal_can_portdatastruct_ptr[1]->canframes_tx_high, cfg->can2_txqhigh_num, sizeof(hal_can_frame_t), ram08);
        ram08 += (cfg->can2_txqhigh_num * sizeof(hal_can_frame_t));
    }

    return(hal_res_OK);

}




// --------------------------------------------------------------------------------------------------------------------
// - definition of static functions 
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_can_supported_is(hal_can_port_t port)
{
    return(hal_base_hid_byte_bitcheck(hal_brdcfg_can__supported_mask, HAL_can_port2index(port)) );
}

