robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_can-with-isr.c
static void s_hal_can_initted_set(hal_can_port_t port)
{
    s_hal_can_initted[HAL_can_port2index(port)] = hal_true;
}

static hal_boolval_t s_hal_can_initted_is(hal_can_port_t port)
{
    return(s_hal_can_initted[HAL_can_port2index(port)]);
}


/*
  * @brief  Interrupt service routine for trasmiting.
  * @param  port identifies CAN port 
  * @retval none
  */
static void s_hal_can_isr_sendframes_canx(hal_can_port_t port)
{
    CanTxMsg stm32txcanframe = {.StdId = 0, .ExtId = 0, .IDE = 0, .RTR = 0, .DLC = 0, .Data = {0, 0, 0, 0, 0, 0, 0, 0}};
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    hal_can_frame_t *frame = NULL;
	uint8_t res = 0;

    if(0 == cport->enabled)
    {
        return;
    }

    while( (hal_base_hid_genericfifo_size(&cport->canframes_tx_norm) > 0) && (res != CAN_NO_MB) )
    {

        frame = (hal_can_frame_t*) hal_base_hid_genericfifo_front(&cport->canframes_tx_norm);

        //convert hal frame in stm frame format
        res = s_hal_frame_convert_2_txstm32format(frame, &stm32txcanframe);

       	res = CAN_Transmit( ((hal_can_port1 == port) ? (CAN1) : (CAN2)), &stm32txcanframe);

        if(res != CAN_NO_MB)
        {
        	hal_base_hid_genericfifo_pop(&cport->canframes_tx_norm);
        }

    }
 
    s_hal_can_isr_tx_disable(port);
    
}


static void s_hal_can_sendframes_canx(hal_can_port_t port)
{
    CanTxMsg stm32txcanframe = {.StdId = 0, .ExtId = 0, .IDE = 0, .RTR = 0, .DLC = 0, .Data = {0, 0, 0, 0, 0, 0, 0, 0}};
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    hal_can_frame_t *frame = NULL;
	uint8_t res = 0;

    if(0 == cport->enabled)
    {
        return;
    }

    s_hal_can_isr_tx_disable(port);

    if(hal_base_hid_genericfifo_size(&cport->canframes_tx_norm) > 0)
    {

        frame = (hal_can_frame_t*) hal_base_hid_genericfifo_front(&cport->canframes_tx_norm);

        //convert hal frame in stm frame format
        res = s_hal_frame_convert_2_txstm32format(frame, &stm32txcanframe);

       	res = CAN_Transmit( ((hal_can_port1 == port) ? (CAN1) : (CAN2)), &stm32txcanframe);

        if(res != CAN_NO_MB)
        {
        	hal_base_hid_genericfifo_pop(&cport->canframes_tx_norm);
        }


        s_hal_can_isr_tx_enable(port);
    }

}



/*
  * @brief  Interrupt service routine for receiving.
  * @param  port identifies CAN port 
  * @retval none
  */
static void s_hal_can_isr_recvframe_canx(hal_can_port_t port)
{
    CanRxMsg stm32rxcanframe;
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    hal_can_frame_t frame = {.id = 0, .id_type = hal_can_frameID_std, .frame_type = hal_can_frame_data, .size = 0, .unused = 0, .data = {0, 0, 0, 0, 0, 0, 0, 0}};
    hal_result_t res;

    if(0 == cport->enabled)
    {
        return;
    }
    
    CAN_Receive( ((hal_can_port1 == port) ? (CAN1) : (CAN2)), /*FIFO0*/0, &stm32rxcanframe);

    //convert stm frame in hal format
    res = s_hal_frame_convert_from_rxstm32format( &frame, &stm32rxcanframe );

    if(hal_res_OK != res)
    {
        return;
    }

    //add frame to queue
    res = hal_base_hid_genericfifo_put(&cport->canframes_rx_norm, (uint8_t*)&frame);

	if(hal_res_OK != res)
	{
	    return;
	}

    //if call back is set, invoke it
    if(NULL != cport->cfg.callback_on_rx )
    {
    	cport->cfg.callback_on_rx(cport->cfg.arg);
    }

}


/*
  * @brief  This function configures clock for CAN.
  * 		Doesn't check input validity.
  * @param  port identifies CAN port
  * @retval None
  */
static void s_hal_can_RCC_conf(hal_can_port_t port)
{

	/* CAN1 and CAN2 Periph clocks enable */
	if(hal_can_port1 == port)
	{
    	/* GPIOD and AFIO clocks enable */
	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIO_CAN1, ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
	}
	else
	{
    	/* GPIOB and AFIO clocks enable */
	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIO_CAN2, ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN2, ENABLE);
	}
}


/*
  * @brief  This function configures GPI0 for CAN.
  * 		Doesn't check input validity.
  * @param  port identifies CAN port
  * @retval None
  */
static void s_hal_can_GPIO_conf(hal_can_port_t port)
{
	GPIO_InitTypeDef  GPIO_InitStructure;

	if(hal_can_port1 == port)/* Configure CAN1 */
	{
		/* RX pin */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN1_RX;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; //Input pull-up
		GPIO_Init(GPIO_CAN1, &GPIO_InitStructure);

		/* TX pin */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN1_TX;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; //Alternate function push-pull
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIO_CAN1, &GPIO_InitStructure);

		/* Remap GPIOs */
		GPIO_PinRemapConfig(GPIO_REMAP_CAN1 , ENABLE);
	}
	else /* Configure CAN2 */
	{
		/* RX pin */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN2_RX;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
		GPIO_Init(GPIO_CAN2, &GPIO_InitStructure);


		/* TX pin */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN2_TX;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIO_CAN2, &GPIO_InitStructure);

		/* Remap GPIOs */
		GPIO_PinRemapConfig(GPIO_REMAP_CAN2, ENABLE);
	}

}

/*
  * @brief  This function configures Nested Vectored Interrupt Controller for CAN.
  * 		Doesn't check input validity.
  * @param  port identifies CAN port
  * @retval None
  */
static void s_hal_can_NVIC_conf(hal_can_port_t port)
{
#if 1
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    IRQn_Type CANx_RX0_IRQn = (hal_can_port1 == port) ? (CAN1_RX0_IRQn) : (CAN2_RX0_IRQn);
    IRQn_Type CANx_TX_IRQn  = (hal_can_port1 == port) ? (CAN1_TX_IRQn) : (CAN2_TX_IRQn);

    if(hal_int_priorityNONE != cport->cfg.priorx)
    {
        // enable rx irq in nvic
        hal_sys_irqn_priority_set(CANx_RX0_IRQn, cport->cfg.priorx);
        hal_sys_irqn_disable(CANx_RX0_IRQn);
    }

    if(hal_int_priorityNONE != cport->cfg.priotx)
    {
        // enable tx irq in nvic
        hal_sys_irqn_priority_set(CANx_TX_IRQn, cport->cfg.priotx);
        hal_sys_irqn_disable(CANx_TX_IRQn);
    }

#else
    // old mode....
//    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

	NVIC_InitTypeDef  NVIC_InitStructure;

