robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_can-with-isr.c
    #warning --> acemor removed it to maintain 16 priorities                                                        
	//NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    //#warning -> so far the priorities of rx and tx can are not used (subprio 0/1 and 2/3 are used instead)
    // they are available in cport->priorx and cport->priotx

	if(hal_can_port1 == port) /* Configure CAN1 */
	{
	  NVIC_InitStructure.NVIC_IRQChannel = CAN1_RX0_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0;
	  NVIC_Init(&NVIC_InitStructure);

	  NVIC_InitStructure.NVIC_IRQChannel = CAN1_TX_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x2;
	  NVIC_Init(&NVIC_InitStructure);

	}
	else /* Configure CAN2 */
	{
	  NVIC_InitStructure.NVIC_IRQChannel = CAN2_RX0_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x1;
	  NVIC_Init(&NVIC_InitStructure);

	  NVIC_InitStructure.NVIC_IRQChannel = CAN2_TX_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x3;
	  NVIC_Init(&NVIC_InitStructure);
	}
#endif
}

static void s_hal_can_isr_tx_enable(hal_can_port_t port)
{
    IRQn_Type CANx_TX_IRQn  = (hal_can_port1 == port) ? (CAN1_TX_IRQn) : (CAN2_TX_IRQn);
    hal_sys_irqn_enable(CANx_TX_IRQn);
}

static void s_hal_can_isr_tx_disable(hal_can_port_t port)
{
    IRQn_Type CANx_TX_IRQn  = (hal_can_port1 == port) ? (CAN1_TX_IRQn) : (CAN2_TX_IRQn);
    hal_sys_irqn_disable(CANx_TX_IRQn);
}


static void s_hal_can_isr_rx_enable(hal_can_port_t port)
{
    IRQn_Type CANx_RX0_IRQn = (hal_can_port1 == port) ? (CAN1_RX0_IRQn) : (CAN2_RX0_IRQn);
    hal_sys_irqn_enable(CANx_RX0_IRQn);
}

static void s_hal_can_isr_rx_disable(hal_can_port_t port)
{
    IRQn_Type CANx_RX0_IRQn = (hal_can_port1 == port) ? (CAN1_RX0_IRQn) : (CAN2_RX0_IRQn);
    hal_sys_irqn_disable(CANx_RX0_IRQn);
}

/*
  * @brief  This function setups CAN hardware and configure baud rate.
  * 		Doesn't check input validity.
  * @param  port identifies CAN port
  * @retval hal_res_NOK_generic in case of error, else hal_res_OK
  */
static hal_result_t s_hal_can_register_conf(hal_can_port_t port)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
	CAN_InitTypeDef        CAN_InitStructure;
	CAN_FilterInitTypeDef  CAN_FilterInitStructure;
	uint8_t				   res;
	uint32_t			   baudrate;

	//init bit timing with default values for baudrate 1Mbps
	uint8_t				   CAN_sjw = CAN_SJW_1tq;
	uint8_t				   CAN_bs1 = CAN_BS1_3tq;
	uint8_t				   CAN_bs2 = CAN_BS2_5tq;
	uint32_t			   brp  = 4;

    switch(cport->cfg.baudrate)
    {
        case hal_can_baudrate_1mbps:    baudrate = 1000000;     break;
        case hal_can_baudrate_500kbps:  baudrate =  500000;     break;
        default:                        baudrate =  500000;     break;
    }

	if(hal_can_port1 == port)
	{
		CAN_DeInit(CAN1);
		//baudrate = hal_base_hid_params.can1_baudrate;
	}
	else
	{
		CAN_DeInit(CAN2);
		//baudrate = hal_base_hid_params.can2_baudrate;
	}

	CAN_StructInit(&CAN_InitStructure);

	/* CAN cell init */
	CAN_InitStructure.CAN_TTCM = DISABLE;
	CAN_InitStructure.CAN_ABOM = DISABLE;
	CAN_InitStructure.CAN_AWUM = DISABLE;
	CAN_InitStructure.CAN_NART = DISABLE;
	CAN_InitStructure.CAN_RFLM = DISABLE;
	CAN_InitStructure.CAN_TXFP = ENABLE; //hardware manages tx frames as fifo

	// set baudrate
	if(baudrate <= 500000  )
	{
		brp =  (CAN_CLK / 18) / baudrate;
		/* TSEG1 = 12, TSEG2 = 5, SJW = 4 => 1 CAN bit = 18 TQ, sample at 72%    */
		CAN_bs1 = 12;
		CAN_bs2 = 5;
		CAN_sjw = 4;
	}
	else if(baudrate <= 1000000)
	{
		brp  = (CAN_CLK / 9) / baudrate;
		/* TSEG1 = 5, TSEG2 = 3, SJW = 3 => 1 CAN bit = 9 TQ, sample at 66%      */
		CAN_bs1 = 5;
		CAN_bs2 = 3;
		CAN_sjw = 3;
	}

	CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
	CAN_InitStructure.CAN_SJW = CAN_sjw-1;;
	CAN_InitStructure.CAN_BS1 = CAN_bs1-1;
	CAN_InitStructure.CAN_BS2 = CAN_bs2-1;
	CAN_InitStructure.CAN_Prescaler = brp;

	if(hal_can_port1 == port)
	{
		res = CAN_Init(CAN1, &CAN_InitStructure);
	}
	else
	{
		res = CAN_Init(CAN2, &CAN_InitStructure);
	}

	if(CANINITFAILED == res)
	{
		return(hal_res_NOK_generic);
	}

	//TODO: rendere configurabile i filtri

	/* CAN filter init */
	CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;

	if(hal_can_port1 == port)
	{
		CAN_FilterInitStructure.CAN_FilterNumber = 0;
		CAN_FilterInit(&CAN_FilterInitStructure);
	}
	else
	{
    	CAN_FilterInitStructure.CAN_FilterNumber = 14;
    	CAN_FilterInit(&CAN_FilterInitStructure);
	}

	return(hal_res_OK);
}



/*
  * @brief  This function converts tx frame from hal format to stm format.
  * @param  frame ptr to hal frame
  * @param  stm32txcanframe ptr to stm frame
  * @retval hal_res_NOK_generic in case id type is unknown or a pointer is NULL, else hal_res_OK
  */
static hal_result_t s_hal_frame_convert_2_txstm32format( hal_can_frame_t *frame, CanTxMsg *stm32txcanframe )
{
	if( (frame == NULL) || (NULL == stm32txcanframe) )
	{
		return(hal_res_NOK_generic);
	}


	if(frame->id_type == hal_can_frameID_std)       //tipo standard
	{
		stm32txcanframe->StdId = frame->id & 0x7FF;
		stm32txcanframe->ExtId = 0; // if frame-id is std it is not used by stm32lib  
        stm32txcanframe->IDE   = CAN_ID_STD;
	}
	else if(frame->id_type == hal_can_frameID_ext) //tipo esteso
	{
        stm32txcanframe->StdId = 0; // if frame-id is ext it is not used by stm32lib
		stm32txcanframe->ExtId = frame->id & 0x1FFFFFFF;
        stm32txcanframe->IDE   = CAN_ID_EXT;
	}
	else
	{
		return(hal_res_NOK_generic);
	}

	stm32txcanframe->RTR = (hal_can_frame_data == frame->frame_type) ? (HAL_can_stm32_framedata) : (HAL_can_stm32_frameremote);   // 0x00 or 0x02
	stm32txcanframe->DLC = (frame->size > 8) ? (8) : (frame->size);
	memcpy(stm32txcanframe->Data, frame->data, stm32txcanframe->DLC);

