robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_can-with-isr.c
	return(hal_res_OK);
}


/*
  * @brief  This function convert rx frame from stm format to hal format.
  * @param  frame ptr to hal frame
  * @param  stm32txcanframe ptr to stm frame
  * @retval hal_res_NOK_generic in case id type is unknown or a pointer is NULL, else hal_res_OK
  */
static hal_result_t s_hal_frame_convert_from_rxstm32format( hal_can_frame_t *frame, CanRxMsg *stm32rxcanframe )
{
	if( (NULL == frame) || (NULL == stm32rxcanframe) )
	{
		return(hal_res_NOK_generic);
	}

	if(CAN_ID_STD == stm32rxcanframe->IDE) //standard type (11 bit)
	{
		frame->id = stm32rxcanframe->StdId;
		frame->id_type = hal_can_frameID_std;
	}
	else if(stm32rxcanframe->IDE == CAN_ID_EXT) //extended type (29 bit)
	{
		frame->id = stm32rxcanframe->ExtId;
		frame->id_type = hal_can_frameID_ext;
	}
	else
	{
		return(hal_res_NOK_generic);
	}

	frame->frame_type = (HAL_can_stm32_framedata == stm32rxcanframe->RTR) ? (hal_can_frame_data) : (hal_can_frame_remote);
	frame->size = stm32rxcanframe->DLC;
	memcpy(frame->data, stm32rxcanframe->Data, frame->size);

	return(hal_res_OK);
}



static hal_result_t s_hal_can_tx_withoutisr(hal_can_port_t port, hal_can_frame_t *frame)
{
    // hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    return(hal_res_NOK_unsupported);
}



static hal_result_t s_hal_can_tx_normprio(hal_can_port_t port, hal_can_frame_t *frame, hal_can_send_mode_t sm)
{
    hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];

    hal_result_t res = hal_res_NOK_generic;
   
    // disable scheduling. 
    hal_base_hid_osal_scheduling_suspend();
    
    // disable interrupt in can 1 or 2 for tx depending on value of port
    //CAN_IT_TX_DISA(port);
    s_hal_can_isr_tx_disable(port);

    // put frame in fifo out normal priority
    res = hal_base_hid_genericfifo_put(&cport->canframes_tx_norm, (uint8_t*)frame);

    // failed to put in fifo
    if(hal_res_OK != res)
    {   // if i cannot tx means that the queue is full, thus ... 
        if(hal_can_send_normprio_now == sm)
        {   // if send-now i empty the queue
            s_hal_can_sendframes_canx(port);
        }
        else
        {   // if send-later i dont empty the queue
            ;
        }

        // and i return error
        hal_base_hid_osal_scheduling_restart();
        return(hal_res_NOK_busy);

// non se se sia piu' valido questo commento
//    	/* Non posso abilitare qui interrupt in tx, perche' nel caso in cui la CAN_put sia 
//    	gia' stata invocata con flag "send now", vengono spediti anche i pachetti aggiunti 
//    	successivamente in coda con flag "send later" */
//    
//    
//        /* Se mi e' stato chiesto di spedire chiamo isr indipendentemente all'esito della put.
//        Se la put ritorna ok, allora significa che ha inserito il frame in input e lo ha spedito;
//        altrimenti significa che la coda e' piena e quindi ho spedito i frame presenti in coda e
//        il frame passato in input e' andato perso.
//        Per spedirlo occorre invocare un'altra volta la can_put */
    
    }
    else
    {   // i could put a frame inside the queue .
        // good for you
    }

    // if i must send now ... i transmit 
    if(hal_can_send_normprio_now == sm)
    {
        s_hal_can_sendframes_canx(port);
    }

    // enable scheduling. 
    hal_base_hid_osal_scheduling_restart();

    return(res);

}



static hal_result_t s_hal_can_tx_highprio(hal_can_port_t port, hal_can_frame_t *frame)
{
    //hal_can_portdatastructure_t *cport = s_hal_can_portdatastruct_ptr[HAL_can_port2index(port)];
    return(hal_res_NOK_unsupported);
}




#endif//HAL_USE_CAN

// --------------------------------------------------------------------------------------------------------------------
// - end-of-file (leave a blank line after)
// --------------------------------------------------------------------------------------------------------------------



